src/config/DataProcessors/СопоставлениеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>СопоставлениеНоменклатурыЕГАИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/config/InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/DataProcessors/СопоставлениеНоменклатурыЕГАИС/Forms/ФормаСозданияНоменклатуры/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСпискаАлкогольнойПродукции = "";
	Параметры.Свойство("АдресСпискаАлкогольнойПродукции", АдресСпискаАлкогольнойПродукции);
	
	МассивЭлементов = ПолучитьИзВременногоХранилища(АдресСпискаАлкогольнойПродукции);
	Если ТипЗнч(МассивЭлементов) <> Тип("Массив") Тогда
		ВызватьИсключение НСтр("ru = 'В форму создания номенклатуры переданы некорректные параметры.'");
	КонецЕсли;
	
	СоответствиеНоменклатуры = ПолучитьСоответствиеНоменклатуры(МассивЭлементов);
	
	Для каждого АлкогольнаяПродукция Из МассивЭлементов Цикл
	
		Если СоответствиеНоменклатуры.Получить(АлкогольнаяПродукция) = Неопределено Тогда
			СписокАлкогольнойПродукции.Добавить(АлкогольнаяПродукция);
		КонецЕсли;
	
	КонецЦикла;
	
	Если СписокАлкогольнойПродукции.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаголовокКоманды = НСтр("ru = 'Создать номенклатуру (%КоличествоЭлементов%)'");
	Элементы.ФормаСоздатьНоменклатуру.Заголовок = СтрЗаменить(ЗаголовокКоманды, "%КоличествоЭлементов%", СписокАлкогольнойПродукции.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСозданияНоменклатуры = Новый Структура;
	ПараметрыСозданияНоменклатуры.Вставить("Родитель"            , Родитель);
	ПараметрыСозданияНоменклатуры.Вставить("ВидНоменклатуры"     , ВидНоменклатуры);
	ПараметрыСозданияНоменклатуры.Вставить("ЕдиницаИзмерения"    , ЕдиницаИзмерения);
	ПараметрыСозданияНоменклатуры.Вставить("СтавкаНДС"           , СтавкаНДС);
	ПараметрыСозданияНоменклатуры.Вставить("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	ПараметрыСозданияНоменклатуры.Вставить("СтранаПроисхождения" , СтранаПроисхождения);
	ПараметрыСозданияНоменклатуры.Вставить("МассивЭлементов"     , СписокАлкогольнойПродукции.ВыгрузитьЗначения());
	
	Закрыть(ПараметрыСозданияНоменклатуры);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеНоменклатуры(МассивАлкогольнойПродукции)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивАлкогольнойПродукции", МассивАлкогольнойПродукции);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция,
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция В(&МассивАлкогольнойПродукции)";
	
	СоответствиеНоменклатуры = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеНоменклатуры.Вставить(Выборка.АлкогольнаяПродукция, Выборка.Номенклатура);
	КонецЦикла;
	
	Возврат СоответствиеНоменклатуры;
	
КонецФункции
